<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Country;

class CountrySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $countries = ["বাংলাদেশ","সৌদি আরব","কুয়েত ","সংযুক্ত আরব আমিরাত","দুবাই","ওমান","কাতার","মালয়েশিয়া","যুক্তরাজ্য","মার্কিন যুক্তরাষ্ট্র","আমেরিকা","ইউরোপ","ইংল্যান্ড","লন্ডন","বাহরাইন","কানাডা","ভারত","চীন","নাইজেরিয়া","ফিলিপাইন","কঙ্গো প্রজাতন্ত্র","জার্মানি","ফ্রান্স","দক্ষিণ আফ্রিকা","ইন্দোনেশিয়া","মেক্সিকো","রাশিয়া","ভিয়েতনাম","তুরস্ক","থাইল্যান্ড","ইতালি","মিয়ানমার","পাকিস্তান","ব্রাজিল","জাপান","ইথিওপিয়া","মিসর","ইরান","তানজানিয়া","কেনিয়া","দক্ষিণ কোরিয়া","উগান্ডা","সুদান","আফগানিস্তান","মরক্কো","পেরু","ঘানা","নেপাল","ক্যামেরুন","উত্তর কোরিয়া","বুরকিনা ফাসো","চিলি","জাম্বিয়া","সিরিয়া","কম্বোডিয়া","জিম্বাবুয়ে","বেনিন","বলিভিয়া","কিউবা","চেক রিপাবলিক","পর্তুগাল","কলম্বিয়া","আর্জেন্টিনা","ইউক্রেন","অ্যাঙ্গোলা","মোজাম্বিক","ভেনেজুয়েলা","কোত দিভোয়ার বা আইভরি কোস্ট","শ্রীলঙ্কা","মালি","মালাউই","গুয়াতেমালা","নেদারল্যান্ডস","চাদ","গিনি","বুরুন্দি","বেলজিয়াম","দক্ষিণ সুদান","গ্রিস","আজারবাইজান","স্পেন","আলজেরিয়া","ইরাক","পোল্যান্ড","উজবেকিস্তান","মালয়েশিয়া","ইয়েমেন","মাদাগাস্কার","নাইজার","অস্ট্রেলিয়া","রোমানিয়া","কাজাখস্তান","ইকুয়েডর","সেনেগাল","সোমালিয়া","রুয়ান্ডা","তিউনিসিয়া","হাইতি","ডমিনিকান রিপাবলিক","জর্ডান","সুইডেন","হন্ডুরাস","তাজিকিস্তান","পাপুয়া নিউ গিনি","সুইজারল্যান্ড","লাওস","লিবিয়া","কিরগিজস্তান","সিঙ্গাপুর","কঙ্গো","লাইবেরিয়া","নিউজিল্যান্ড","কুয়েত","জর্জিয়া","বসনিয়া অ্যান্ড হারজেগোভিনা","জ্যামাইকা","লিথুয়ানিয়া","বতসোয়ানা","উত্তর মেসিডোনিয়া","লাটভিয়া","ত্রিনিদাদ অ্যান্ড টোবাগো","বেলারুশ","সার্বিয়া","টোগো","প্যারাগুয়ে","লেবানন","এল সালভাদর","ডেনমার্ক","স্লোভাকিয়া","আয়ারল্যান্ড","মৌরিতানিয়া","ক্রোয়েশিয়া","ইরিত্রিয়া","মঙ্গোলিয়া","নামিবিয়া","গ্যাবন","স্লোভেনিয়া","এস্তোনিয়া","হাঙ্গেরি","অস্ট্রিয়া","ইসরায়েল","সিয়েরা লিওন","বুলগেরিয়া","নিকারাগুয়া","তুর্কমিনিস্তান","ফিনল্যান্ড","নরওয়ে","কোস্টারিকা","সেন্ট্রাল আফ্রিকান রিপাবলিক","পানামা","মলদোভা","উরুগুয়ে","আর্মেনিয়া","আলবেনিয়া","গাম্বিয়া","লেসেতে","গিনি-বিসাউ","ইকুইটরিয়াল গায়ানা","পূর্ব তিমুর বা তিমুর-লেস্তে","মরিশাস","জিবুতি","গায়ানা","মন্টেনেগ্রো","কেপ ভার্দে","মাল্টা","বাহামাস","বার্বাডোজ","সেইন্ট লুসিয়া","সেন্ট ভিনসেন্ট অ্যান্ড গ্রেনাডাইন","অ্যান্টিগুয়া অ্যান্ড বারবুডা","মার্শাল আইল্যান্ড","লিচটেনস্টেইন","টুভালু","সাইপ্রাস","ফিজি","ভুটান","লুক্সেমবার্গ","মাইক্রোনেশিয়া","ব্রুনেই","আইসল্যান্ড","সাও টোমে অ্যান্ড প্রিন্সিপে","কিরিবাতি","টোঙ্গো","অ্যান্ডোরা","সেন্ট কিটস অ্যান্ড নেভিস","সান মারিনো","ইসোয়াতিনি","কোমোরোস","সলোমান আইল্যান্ড","সুরিনাম","মালদ্বীপ","বেলিজ","ভানুয়াতু","সামোয়া","গ্রেনাডা","সিসেলেস","ডোমিনিকা","মোনাকো","পালাউ","এণ্ড নাউরু","হলি সিটি বা ভ্যাটিকান সিটি","ফিলিস্তিন","তাইওয়ান ","কোসোভো","অন্য দেশ"];

        foreach ($countries as $country) {
            Country::create([
                'title' => $country,
                'slug' => preg_replace('/\s+/', '-', $country),
                'status' => 1
            ]);
        }

    }
}
