<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Degree;

class DegreeSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $degrees = ["মাধ্যমিক","উচ্চ মাধ্যমিক","ডিপ্লোমা / কোর্স","স্নাতক / ব্যাচেলর ডিগ্রি","স্নাতকোত্তর / মাস্টার ডিগ্রী","ডক্টর অফ পিএইচডি (পিএইচ.ডি)","মাস্টার অফ ফিলোসফি (এমফিল)","বাংলাদেশ সিভিল সার্ভিস (বিসিএস)","মাধ্যমিক পাশ নাই"];

        foreach ($degrees as $degree) {
            Degree::create([
                'title' => $degree,
                'slug' => preg_replace('/\s+/', '-', $degree),
                'parent_id' => 0,
                'status' => 0
            ]);
        }

        $secondaries = ["এসএসসি","ও লেভেল","দাখিল (মাদ্রাসা)","এসএসসি (ভোকেশনাল)","এসএসসি (সমমান)"];

        foreach ($secondaries as $secondary) {
            Degree::create([
                'title' => $secondary,
                'slug' => preg_replace('/\s+/', '-', $secondary),
                'parent_id' => 1,
                'status' => 1
            ]);
        }

        $highersecondaries = ["এইচএসসি","একটি স্তর","আলিম (মাদ্রাসা)","এইচএসসি (ভোকেশনাল)","এইচএসসি (সমমান)"];

        foreach ($highersecondaries as $highersecondary) {
            Degree::create([
                'title' => $highersecondary,
                'slug' => preg_replace('/\s+/', '-', $highersecondary),
                'parent_id' => 2,
                'status' => 1
            ]);
        }

        $diplomas = ["ডিপ্লোমা ইন ইঞ্জিনিয়ারিং","ডিপ্লোমা ইন মেরিন ইঞ্জিনিয়ারিং","ডিপ্লোমা ইন টেক্সটাইল ইঞ্জিনিয়ারিং","ডিপ্লোমা ইন মেডিকেল ","ডিপ্লোমা ইন মেডিকেল টেকনোলজি","ডিপ্লোমা ইন নার্সিং","ডিপ্লোমা ইন নার্সিং অ্যান্ড মিডওয়াইফারি","ডিপ্লোমা ইন প্যাথলজি","ডিপ্লোমা ইন হোটেল ম্যানেজমেন্ট","ডিপ্লোমা ইন এগ্রিকালচার","ডিপ্লোমা ইন ফিশারিজ ","ডিপ্লোমা ইন ফরেস্ট্রি","ডিপ্লোমা ইন লাইভস্টক","ডিপ্লোমা ইন সিভিল ইঞ্জিনিয়ারিং","ডিপ্লোমা ইন আর্কিটেকচার ইঞ্জিনিয়ারিং","ডিপ্লোমা ইন মেকানিক্যাল ইঞ্জিনিয়ারিং","ডিপ্লোমা ইন কম্পিউটার ইঞ্জিনিয়ারিং","ডিপ্লোমা ইন ইলেকট্রিক্যাল ইঞ্জিনিয়ারিং","ডিপ্লোমা ইন ইলেকট্রনিক্স ইঞ্জিনিয়ারিং","ডিপ্লোমা ইন পাওয়ার ইঞ্জিনিয়ারিং","ডিপ্লোমা ইন অটোমোবাইল ইঞ্জিনিয়ারিং","ডিপ্লোমা ইন রেফ্রিজারেশন অ্যান্ড এয়ার কন্ডিশন","ডিপ্লোমা ইন ইলেক্ট্রো মেডিকেল","ডিপ্লোমা ইন বিজনেস স্টাডিজ","এইচএসসি-ভিওসি","এইচএসসি-বিএমটি (ব্যবসা ব্যবস্থাপনা ও প্রযুক্তি)","সার্টিফিকেট ইন মেরিন ট্রেড","পোস্ট গ্র্যাজুয়েট ডিপ্লোমা (পিজিডি)"];

        foreach ($diplomas as $diploma) {
            Degree::create([
                'title' => $diploma,
                'slug' => preg_replace('/\s+/', '-', $diploma),
                'parent_id' => 3,
                'status' => 1
            ]);
        }


        $bachelors = ["ব্যাচেলর অফ সাইন্স (বিএসসি)","ব্যাচেলর অফ আর্টস (বিএ)","ব্যাচেলর অফ কমার্স (বিকম)","ব্যাচেলর অফ সোশ্যাল সাইন্স (বিএসএস)","ডিগ্রী পাস কোর্স","ব্যাচেলর অফ বিজনেস অ্যাডমিনিস্ট্রেশন (বিবিএ)","ব্যাচেলর অফ বিজনেস স্টাডিজ (বিবিএস)","চার্টার্ড অ্যাকাউন্ট্যান্ট ( সিএ)","ব্যাচেলর অফ মেডিসিন অ্যান্ড ব্যাচেলর অফ সার্জারি (এমবিবিএস)","ব্যাচেলর অফ ডেন্টাল সার্জারি (বিডিএস)","ডক্টর অফ ভেটেরিনারি মেডিসিন (ডিভিএম)","ব্যাচেলর অফ ফার্মেসি (বি.ফার্ম)","ব্যাচেলর অফ ইঞ্জিনিয়ারিং ( বি. ইঞ্জি)","ব্যাচেলর অফ কম্পিউটার সায়েন্স অ্যান্ড ইঞ্জিনিয়ারিং (সিএসই)","ব্যাচেলর অফ আইন (এলএলবি)","ব্যাচেলর অফ এডুকেশন (বি.এড)","ব্যাচেলর অফ আর্কিটেকচার (বি.আর্ক)","ব্যাচেলর অফ ফাইন আর্টস (বি.এফ.এ)","ফাজিল (মাদ্রাসা)"];

        foreach ($bachelors as $bachelor) {
            Degree::create([
                'title' => $bachelor,
                'slug' => preg_replace('/\s+/', '-', $bachelor),
                'parent_id' => 4,
                'status' => 1
            ]);
        }


        $masters = ["মাস্টার অফ সাইন্স (এমএসসি)","মাস্টার অফ আর্টস (এমএ)","মাস্টার অফ কমার্স (এমকম)","মাস্টার অফ সোশ্যাল সাইন্স (এমএসএস)","এক্সিকিউটিভ মাস্টার অফ বিজনেস অ্যাডমিনিস্ট্রেশন (ইএমবিএ)","মাস্টার অফ বিজনেস অ্যাডমিনিস্ট্রেশন (এমবিএ)","মাস্টার অফ বিজনেস স্টাডিজ (এমবিএস)","ফেলোশিপ অফ কলেজ অফ ফিজিশিয়ানস অ্যান্ড সার্জনস (এফসিপিএস)","মাস্টার অফ ডেন্টাল সার্জারি (এমডিএস)","মাস্টার অফ ভেটেরিনারি সাইন্স (এমভিএস)","মাস্টার অফ ফার্মেসি (বি.ফার্ম)","মাস্টার অফ ইঞ্জিনিয়ারিং (এম.ইঞ্জি)","মাস্টার অফ কম্পিউটার সায়েন্স অ্যান্ড ইঞ্জিনিয়ারিং (এমএসসি)","মাস্টার অফ আইন (এলএলএম)","মাস্টার অফ এডুকেশন (বি.এড)","মাস্টার অফ আর্কিটেকচার  (এম.আর্ক)","মাস্টার অফ ফাইন আর্টস (এমএফএ)","কামিল (মাদ্রাসা)"];

        foreach ($masters as $master) {
            Degree::create([
                'title' => $master,
                'slug' => preg_replace('/[\/\s]+/', '-', $master),
                'parent_id' => 5,
                'status' => 1
            ]);
        }

    }
}
