<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Profession;

class ProfessionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $professions = ["প্রশাসনিক কর্মকর্তা", "বিসিএস ক্যাডার", "ডাক্তার", "ইঞ্জিনিয়ার", "আইনজীবী", "ডেন্টিস্ট", "ভেটেরিনারি ডাক্তার", "চার্টার্ড অ্যাকাউন্ট্যান্ট (সিএ)", "প্রকৌশলী", "ব্যাংকার", "ফিজিও থেরাপিস্ট", "ফার্মাসিস্ট", "মহাপরিচালক", "প্রধান কর্মকর্তা", "কর্মকর্তা", "সহকারী কর্মকর্তা", "কর্মচারী", "সহকারী কর্মচারী", "ম্যানেজার", "অফিসার", "সহকারী অফিসার", "ফাইন্যান্স অফিসার", "হিসাবরক্ষক / কোষাধ্যক্ষ", "কম্পিউটার অপারেটর", "অফিস সহকারী", "সেনাবাহিনী", "বিমান বাহিনী", "নৌবাহিনী", "বর্ডার গার্ড বাংলাদেশ (বিজিবি)", "র‌্যাপিড অ্যাকশন ব্যাটালিয়ন (র‍্যাব)", "ফায়ার ফাইটার / অগ্নিনির্বাপক", "পুলিশ", "প্রতিরক্ষা অফিসার", "বিমান - চালক", "বিমানবালা", "আনসার", "শিক্ষক", "শিক্ষিকা", "প্রভাষক", "অধ্যক্ষ / প্রিন্সিপাল", "অধ্যাপক / প্রফেসর", "অর্থনীতিবিদ", "কৃষিবিদ", "ফুড অফিসার", "ফরেস্ট অফিসার", "মৎস্য অফিসার", "ভূতত্ত্ববিদ", "খনি কর্মকর্তা", "বিজ্ঞানী / গবেষক", "মনোবিজ্ঞানী", "হাফেজ / মৌলভী", "এনজিও", "বীমা", "প্রবাসী", "শিল্পপতি / সিইও", "ব্যবসা", "কৃষক", "গৃহিণী", "শিক্ষার্থী", "বেকার / কর্মহীন", "অবসরপ্রাপ্ত", "উদ্যোক্তা", "দোকানদার", "ফ্রিল্যান্সার", "আইটি বিজনেজ", "ডিজিটাল মার্কেটিং", "ডাটা এনালিস্ট", "কন্টেন্ট ক্রিয়েটর", "ইউটিউবার", "শিল্পী", "গায়ক / সুরকার", "সাংস্কৃতিক শিল্পী", "মডেল", "লেখক / কবি", "সমাজসেবী", "সম্পাদক", "সাংবাদিক", "সংবাদ উপস্থাপক", "রেডিও জোকি", "ক্রিকেটার", "ফুটবলার", "খেলোয়াড়", "ফ্যাশন ডিজাইনার", "বিউটিশিয়ান", "ফটোগ্রাফার", "বিক্রয় প্রতিনিধি", "কাস্টমার কেয়ার", "রিসেপশনিস্ট", "নার্স", "আয়া", "বায়িং হাউস", "গার্মেন্টসকর্মী", "দর্জি", "বাবুর্চী / শেফ", "রেস্টুরেন্ট / রিসোর্ট কর্মী", "টেকনিশিয়ান  / কারিগর", "ড্রাইভার", "মিস্ত্রী / শ্রমিক", "পরিচ্ছন্নতা কর্মী", "অন্য পেশা"];
        foreach ($professions as $profession) {
            Profession::create([
                'title' => $profession,
                'slug' => preg_replace('/\s+/', '-', $profession),
                'status' => 1
            ]);
        }

    }
}
